###Вывести матрицу 1

На вход программе подаются два натуральных числа 
n и m, каждое на отдельной строке — количество строк и столбцов в матрице. Далее вводятся сами элементы матрицы — слова, каждое на отдельной строке; подряд идут элементы сначала первой строки, затем второй, и т.д.

Напишите программу, которая сначала считывает элементы матрицы один за другим, затем выводит их в виде матрицы.

Формат входных данных

На вход программе подаются два числа 
n и m — количество строк и столбцов в матрице, далее идут n×m слов, каждое на отдельной строке.

Формат выходных данных

Программа должна вывести считанную матрицу, разделяя ее элементы одним пробелом.
```
Sample Input 2:
2
3
язык
болтает
а
голова
не
знает

Sample Output 2:
язык болтает а
голова не знает
```
```python
def task(n, m):
    sample = [input() for _ in range(n * m)]
    for i in range(1, n + 1):
        print(*sample[m * i - m:m * i])


task(int(input()), int(input()))
```
___
###Вывести матрицу 2

На вход программе подаются два натуральных числа n и m, каждое на отдельной строке — количество строк и столбцов в матрице. Далее вводятся сами элементы матрицы — слова, каждое на отдельной строке; подряд идут элементы сначала первой строки, затем второй, и т.д.

Напишите программу, которая считывает элементы матрицы один за другим, выводит их в виде матрицы, выводит пустую строку, и снова ту же матрицу, но уже поменяв местами строки со столбцами: первая строка выводится как первый столбец, и так далее.

Формат входных данных

На вход программе подаются два числа n и m — количество строк и столбцов в матрице, далее идут 
n×m слов, каждое на отдельной строке.

Формат выходных данных

Программа должна вывести считанную матрицу, за ней пустую строку, и ту же матрицу, но поменяв местами строки со столбцами. Элементы матрицы разделять одним пробелом.
```
Sample Input 1:
4
2
и
швец
и
жнец
и
на
дуде
игрец

Sample Output 1:
и швец
и жнец
и на
дуде игрец

и и и дуде
швец жнец на игрец
```
```python
def task(n, m):
    sample = [input() for _ in range(n * m)]
    for i in range(1, n + 1):
        print(*sample[m * i - m:m * i])
    print()
    for j in range(m):
        for i in range(0, n * m, m):
            print(sample[i + j], end=' ')
        print()


task(int(input()), int(input()))
```
___
###След матрицы

Следом квадратной матрицы называется сумма элементов главной диагонали. Напишите программу, которая выводит след заданной квадратной матрицы.

Формат входных данных

На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.

Формат выходных данных

Программа должна вывести одно число — след заданной матрицы.
```
Sample Input 1:
3
1 2 3
4 5 6
7 8 9

Sample Output 1:
15
```

```python
i_ = int(input())
result = 0
for i in range(i_):
    result += int(input().split()[i])

print(result)
```
___
###Больше среднего

Напишите программу, которая выводит количество элементов квадратной матрицы в каждой строке, больших среднего арифметического элементов данной строки.

Формат входных данных

На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.

Формат выходных данных

Программа должна вывести n чисел — для каждой строки количество элементов матрицы, больших среднего арифметического элементов данной строки.
```
Sample Input 1:
4
1 2 3 4
5 6 3 15
0 2 3 1
5 2 8 5

Sample Output 1:
2
1
2
1
```
```python
def task():
    from statistics import mean
    
    
    for _ in range(int(input())):
        b = [int(i) for i in input().split()]
        print(len([i for i in b if i > mean(b)]))
```
```python
def task():
    for _ in range(int(input())):
        lst = list(map(int, input().split()))
        avg = sum(lst) / len(lst)
        print(sum(i > avg for i in lst))
```
___
###Максимальный в области 1

Напишите программу, которая выводит максимальный элемент в заштрихованной области квадратной матрицы.
```
1 
6 7 
1 1 6
```
Формат входных данных

На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.

Формат выходных данных

Программа должна вывести одно число — максимальный элемент в заштрихованной области квадратной матрицы.

Примечание. Элементы главной диагонали также учитываются.
```
Sample Input 1:
3
1 4 5
6 7 8
1 1 6

Sample Output 1:
7
```
```python
row = int(input())
matrix = [list(map(int, input().split())) for _ in range(row)]

max_ = matrix[0][0]
    
for i in range(row):
    for j in range(row):
        if i >= j and max_ < matrix[i][j]:
            max_ = matrix[i][j]
            
            
print(max_)
```
___
###Максимальный в области 2 🌶️

Напишите программу, которая выводит максимальный элемент в заштрихованной области квадратной матрицы.
```
1   9
6 7 8
1   6
```
Формат входных данных

На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.

Формат выходных данных

Программа должна вывести одно число — максимальный элемент в заштрихованной области квадратной матрицы.

Примечание. Элементы диагоналей также учитываются.
```
Sample Input 1:
3
1 4 5
6 7 8
1 1 6

Sample Output 1:
8
```

```python
row = int(input())
matrix = [list(map(int, input().split())) for _ in range(row)]
max_ = matrix[0][0]

for i in range(row):
    for j in range(row):
        if j <= i < row - i - j and max_ < matrix[i][j] or j >= i >= row - i - j and max_ < matrix[i][j]:
            max_ = matrix[i][j]

print(max_)
```
___
###Суммы четвертей

Квадратная матрица разбивается на четыре четверти, ограниченные главной и побочной диагоналями: верхнюю, нижнюю, левую и правую.

Напишите программу, которая вычисляет сумму элементов: верхней четверти; правой четверти; нижней четверти; левой четверти.

Формат входных данных

На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.

Формат выходных данных

Программа должна вывести текст в соответствии с условием задачи.

Примечание. Элементы диагоналей не учитываются.
```
Sample Input 1:
4
1 2 3 4
5 6 7 8
3 4 5 6
1 2 3 4

Sample Output 1:
Верхняя четверть: 5
Правая четверть: 14
Нижняя четверть: 5
Левая четверть: 8
```
```python
row = int(input())
matrix = [list(map(int, input().split())) for _ in range(row)]

max_left = list()
max_down = list()
max_up = list()
max_rigth = list()

for i in range(row):
    for j in range(row):
        if i > j and i < row - 1 - j:    # left
            max_left.append(matrix[i][j])
        elif i > j and i > row - 1 - j:    # down
            max_down.append(matrix[i][j])
        elif i < j and i < row - 1 - j:    # up
            max_up.append(matrix[i][j])
        elif i < j and i > row - 1 - j:    # rigth
            max_rigth.append(matrix[i][j])

print(f'Верхняя четверть: {sum(max_up)}\n\
Правая четверть: {sum(max_rigth)}\n\
Нижняя четверть: {sum(max_down)}\n\
Левая четверть: {sum(max_left)}')
```