###Список по образцу 1

На вход программе подается число n. Напишите программу, которая создает и выводит построчно список, состоящий из 
n списков 
```
[[1, 2, ..., n], [1, 2, ..., n], ..., [1, 2, ..., n]].
```
Формат входных данных

На вход программе подается натуральное число n.

Формат выходных данных

Программа должна вывести построчно указанный список.
```
Sample Input 1:
3

Sample Output 1:
[1, 2, 3]
[1, 2, 3]
[1, 2, 3]
```
```python
column = int(input())
[print([i for i in range(1, column + 1)]) for _ in range(column)]
```
---
###Список по образцу 2

На вход программе подается число n. Напишите программу, которая создает и выводит построчно вложенный список, состоящий из 
n списков
```
[[1], [1, 2], [1, 2, 3], ..., [1, 2, ..., n]].
```

Формат входных данных

На вход программе подается натуральное число n.

Формат выходных данных

Программа должна вывести построчно указанный вложенный список.

```
Sample Input 1:
4

Sample Output 1:
[1]
[1, 2]
[1, 2, 3]
[1, 2, 3, 4]
```
```python
row = int(input())
for column in range(1, row + 1):
    print([i for i in range(1, column + 1)])
```
___
###Треугольник Паскаля 1 🌶️

Треугольник Паскаля — бесконечная таблица биномиальных коэффициентов, имеющая треугольную форму. В этом треугольнике на вершине и по бокам стоят единицы. Каждое число равно сумме двух расположенных над ним чисел.
```
0:      1
1:     1 1
2:    1 2 1
3:   1 3 3 1
4:  1 4 6 4 1
      .....
```
На вход программе подается число n. Напишите программу, которая возвращает указанную строку треугольника Паскаля в виде списка (нумерация строк начинается с нуля).

Формат входных данных

На вход программе подается число n (n≥0).

Формат выходных данных

Программа должна вывести указанную строку треугольника Паскаля в виде списка.

```
Sample Input 4:
3

Sample Output 4:
[1, 3, 3, 1]
```
```python
from math import factorial


n = int(input())
result = [1]
for m in range(1, n + 1):
    if n - m >= 0:
        result.append(int(factorial(n) / (factorial(m) * factorial(n - m))))
print(result)
```
```python
def task():
    n = int(input())
    
    li = [1]
    for i in range(n):
        for j in range(len(li) - 1):
            li[j] = li[j] + li[j + 1]
        li.insert(0, 1)
    
    print(li)


task()
```
___
###Треугольник Паскаля 2

На вход программе подается натуральное число n. Напишите программу, которая выводит первые 
n строк треугольника Паскаля.

Формат входных данных

На вход программе подается число n (n≥1).

Формат выходных данных

Программа должна вывести первые n строк треугольника Паскаля, каждую на отдельной строке в соответствии с образцом.
```
Sample Input 1:
4

Sample Output 1:
1
1 1
1 2 1
1 3 3 1
```
```python
def pascal_triangle(n=3):
    from math import factorial
    result = [1]
    for m in range(1, n + 1):
        if n - m >= 0:
            x = factorial(n) / (factorial(m) * factorial(n - m))
            result.append(int(x))
    print(*result)


def pascal_triangle_str(n):
    for i in range(n):
        pascal_triangle(i)


pascal_triangle_str(int(input()))
```
___
###Упаковка дубликатов 🌶️

На вход программе подается строка текста, содержащая символы. Напишите программу, которая упаковывает последовательности одинаковых символов заданной строки в подсписки.

Формат входных данных

На вход программе подается строка текста, содержащая символы, отделенные символом пробела.

Формат выходных данных

Программа должна вывести указанный вложенный список.
```
Sample Input 1:
a b c d

Sample Output 1:
[['a'], ['b'], ['c'], ['d']]
```
```python
def packing_duplicates(a):
    from itertools import groupby

    print([list(g) for _, g in groupby(a)])


packing_duplicates(input().split())
```
___
###Разбиение на чанки 🌶️

На вход программе подаются две строки, на одной символы, на другой число 
n. Из первой строки формируется список.

Реализуйте функцию chunked(), которая принимает на вход список и число, задающее размер чанка (куска), а возвращает список из чанков указанной длины.

Формат входных данных

На вход программе подается строка текста, содержащая символы, отделенные символом пробела и число 
n на отдельной строке.

Формат выходных данных

Программа должна вывести указанный вложенный список.
```
Sample Input 1:
a b c d e f
2

Sample Output 1:
[['a', 'b'], ['c', 'd'], ['e', 'f']]
```
```python
def chunking(x, m):
    x = x.split()
    result = list()

    while x:
        y = list()
        try:
            for i in range(m):
                y.append(x[0])
                x.pop(0)
        except IndexError:
            pass
        result.append(y)
    print(result)


chunking(input(), int(input()))
```
```python
def task(symbols, n):
    result = []
    for i in range(0, len(symbols), n):
        result.append(symbols[i:i + n])
    print(result)
    """return [symbols[x:x + n] for x in range(0, len(symbols), n)]"""


task(input().split(), int(input()))
```
```python
def task(symbols, n):
    return [symbols[x:x + n] for x in range(0, len(symbols), n)]


print(task(input().split(), int(input())))
```
___

###Подсписки списка 🌶️🌶️

Формат входных данных

На вход программе подается строка текста, содержащая символы, отделенные символом пробела.

Формат выходных данных

Программа должна вывести указанный список, содержащий все возможные подсписки, включая пустой список в соответствии с примерами.

Примечание. Порядок списков одинаковой длины должен соответствовать порядку их вхождения в основной список.
```
Sample Input 2:
a b v

Sample Output 2:
[[], ['a'], ['b'], ['v'], ['a', 'b'], ['b', 'v'], ['a', 'b', 'v']]
```
```python
def sublists_of_the_list(symbols):
    symbols = symbols.split()
    n = len(symbols)
    a = list()
    result = list([[]])

    for i in range(n+1):
        for j in range(n+1):
            a.append(symbols[i:j])

    for i in a:
        if i:
            result.append(i)
    result.sort(key=lambda i: len(i))
    print(result)


sublists_of_the_list(input())
```